Repository: GonePerf/MyPortfolio
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pl

source: MY PROJECTS
pl: PROJEKTY

source: TOOLS
pl: NARZĘDZIA

source: ABOUT ME
pl: O MNIE

# Elasticsearch
source: I have practical experience with Elasticsearch, gained mainly through my work at OPGK. In a team of three, we designed and implemented a package extending OTRS with Elasticsearch due to the low efficiency of SQL. Our module works in parallel with a MySQL database and, by using the right mechanism mechanism that triggers specific actions e.g. when adding a new request, the data in the Elasticsearch data are automatically updated on an ongoing basis.
pl: Mam praktyczne doświadczenie z Elasticsearch, zdobyte głównie dzięki pracy w OPGK. W trzyosobowym zespole zaprojektowaliśmy i zaimplementowaliśmy paczkę rozszerzającą OTRS o Elasticsearch’a ze względu na małą efektywność SQL’a. Nasz moduł działa równolegle z bazą MySQL a dzięki wykorzystaniu odpowiedniego mechanizmu wywołującego określone akcje np. w trakcie dodawania nowego zgłoszenia, dane w Elasticsearch’u są na bieżąco automatycznie aktualizowane.

# Vue
source: I first encountered Vue two years ago during an internship at Ideo. This framework immediately appealed to me and I intend to use it. I have hands-on experience with Vue.js 2.0. With Vue 2.0, I can create dynamic and interactive web applications using component-based architecture, reactive data binding, routing, etc. I am familiar with Vue.js 3.0, the latest version of Vue.js. Vue 3.0 introduces several improvements, including a faster rendering engine, better TypeScript support and improved responsiveness with the Composition API.
pl: Pierwszy raz z Vue spotkałem się 2 lata temu na praktykach w firmie Ideo. Ten framework od razu przypadł mi do gustu i zamierzam z niego korzystać. Mam praktyczne doświadczenie z Vue.js 2.0. Dzięki Vue 2.0 mogę tworzyć dynamiczne i interaktywne aplikacje internetowe przy użyciu architektury opartej na komponentach, reaktywnego wiązania danych, routingu itp. Jestem zaznajomiony z Vue.js 3.0, najnowszą wersją Vue.js. Vue 3.0 wprowadza kilka ulepszeń, w tym szybszy silnik renderujący, lepszą obsługę TypeScript i ulepszoną reaktywność dzięki Composition API.

# DJango
source: I like Python because it has a very simple syntax. I've been using DJango for about a month now. I wrote this page using just DJango - SSR has the advantage of sending ready-made HTML documents to the user so I decided not to use Vue here. The application has a SQLite database and I can edit the description of any technology or project at any time and also add new elements.
pl: Lubię Pythona bo ma bardzo prostą składnię. DJango używam od jakiegoś miesiąca. Tę stronę napisałem za pomocą właśnie DJango - SSR ma to do siebie, że przesyła do użytkownika gotowe dokumenty HTML dlatego postanowiłem nie korzystać tutaj z Vue. Aplikacja posiada bazę danych SQLite i mogę edytować opis każdej technologii czy projektu w dowolnej chwili a także dodawać nowe elementy.

# Git
source: I am proficient in using Git, a version control system, to manage source code and track changes in software projects. Additionally, I am experienced in a command-line interface tool, to execute Git commands and perform various operations efficiently. With my knowledge of Git and Git Bash, I can effectively collaborate on projects and ensure good team work.
pl: Biegle posługuję się Git'em, systemem kontroli wersji, do zarządzania kodem źródłowym aplikacji i śledzenia zmian w projektach. Dodatkowo, posiadam doświadczenie w posługiwaniu się wierszem poleceń, potrafię zarządzać repozytorium z poziomu terminala. Dzięki mojej znajomości Git'a mogę efektywnie współpracować przy projektach i zapewnić dobrą pracę zespołową.

# MySQL
source: I have proficiency in MySQL and extensive experience in crafting effective database queries. With a solid understanding of SQL syntax and database design principles, I can efficiently create queries to retrieve, manipulate, and manage data. Whether it's constructing complex joins, optimizing queries for performance, or implementing data filtering and sorting, I leverage MySQL's capabilities to ensure efficient and reliable data operations.
pl: Posiadam dużą wiedzę o MySQL i duże doświadczenie w tworzeniu efektywnych zapytań do baz danych. Dzięki solidnemu zrozumieniu składni SQL i zasad projektowania baz danych, mogę efektywnie tworzyć zapytania w celu pobierania danych, manipulowania nimi i zarządzania nimi. Niezależnie od tego, czy chodzi o konstruowanie złożonych złączeń, optymalizację zapytań pod kątem wydajności, czy też wdrażanie filtrowania i sortowania danych, wykorzystuję możliwości MySQL, aby zapewnić wydajne i niezawodne operacje na danych.

# Terminal
source: I possess good command over command line interfaces and scripting languages, enabling me to effectively utilize terminals in Linux and Windows. With expertise in scripting languages like Bash, I develop efficient automation scripts to streamline processes, enhance productivity, and minimize manual effort.
pl: Dobrze znam interfejsy wiersza poleceń w systemach Linux i Windows. Dzięki doświadczeniu w językach skryptowych, takich jak Bash, potrafię opracowywać wydajne skrypty automatyzacji w celu usprawnienia procesów, zwiększenia produktywności i zminimalizowania ręcznego wysiłku.

# Docker
source: I can use containerisation, I have run containers with various applications, I have configured containers with client environments. I can use Portainer and also manage containers from a terminal. I can bind the right directories to the host allowing me to work on files easily.
pl: Potrafię korzystać z konteneryzacji, uruchamiałem kontenery z różnymi aplikacjami, konfigurowałem kontenery z środowiskami klientów. Potrafię korzystać z Portainera, a także zarządzać kontenerami z poziomu terminala. Potrafię zbindować odpowiednie katalogi na hosta umożliwiając łatwą pracę na plikach.

# More
source: The list includes only some of the tools I have had the opportunity to use. I have extensive knowledge of algorithms, object-oriented and functional programming, SSR and SPA.
pl: Lista zawiera jedynie niektóre narzędzia z których miałem okazję korzystać. Posiadam szeroką wiedzę z zakresu algorytmów, programowania obiektowego i funkcyjnego, SSR i SPA.

# NodeJS
source: I can use NPM, the package manager for JS. I use it to easily import libraries and connect them to my projects. I have learnt about Angular and AngularJS, ExpressJS and helped develop a microservices based application - Hemera JS.
pl: Potrafię korzystać z NPM'a - menedżera pakietów do JS. Za jego pomocą łatwo importuję biblioteki i podłączam je do moich projektów. Poznałem Angulara i AngularaJS, ExpressJS oraz pomagałem w tworzeniu aplikacji opartej o mikroserwisy - Hemera JS.

# SCSS
source: I use CSS preprocessors for my work if I can - they allow nice nesting of blocks, add the right tags that most browsers read and you can also declare variables in them. I used SCSS when creating this portfolio.
pl: Jeśli mogę to wykorzystuję preprocesory CSS do pracy - pozwalają one na przyjemne zagnieżdżanie bloków, dodają odpowiednie znaczniki które czyta większość przeglądarek a także można w nich deklarować zmienne. Podczas tworzenia tego portfolio korzystałem z SCSS.

# Laravel
source: I first came into contact with laravel at university, where all I had to do was ask a few questions to a colleague who already had quite advanced knowledge and could easily navigate this framework to create a simple backend with the right models and endpoints for database operations. During my time at OPGK, I also helped implement a backend for an online shop.
pl: Z laravelem pierwszy raz miałem styczność na studiach, gdzie wystarczyło mi zadać kilka pytań koledze, który posiadał już dosyć zaawansowaną wiedzę i łatwo poruszał się po tym frameworku, aby stworzyć prosty backend z odpowiednimi modelami i endpointami do operacji na bazie danych. Podczas pracy w OPGK również pomagałem w implementacji Backendu do sklepu internetowego.

# Figma
source: I can create simple graphics in figma. In addition, having mock-ups, I am able to write a GUI implementation of the website quite quickly. I also use FontAwesome and GoogleFonts in my work.
pl: Potrafię tworzyć proste grafiki w figmie. Dodatkowo posiadając makiety jestem w stanie dość szybko napisać implementację interfejsu graficznego strony. Wykorzystuję również FontAwesome oraz GoogleFonts w swojej pracy.

# Portfolio
source: A website written in DJango, it has a SQLite database, object-relational mapping. I used SCSS to build it. The main functionalities are changing the skin to dark and light - using JS and localStorage. The application has two languages which can be changed in the top left corner or in the link. It is a kind of CMS that allows me to manage the content of the site without interfering with its code - by manipulating the database.
pl: Strona internetowa napisana w DJango, posiada ona bazę danych SQLite oraz mapowanie obiektowo relacyjne. Wykorzystałem do jej zbudowania SCSS. Główne funkcjonalności to zmiana skórki na ciemną i jasną - za pomocą JS i localStorage. Aplikacja posiada dwa języki które można zmienić w lewym górnym rogu lub w linku. Jest to swego rodzaju CMS pozwalający mi na zarządzanie treścią strony bez ingerencji w jej kod - manipulując bazą danych.

# TourOn
source: Together with the team, we designed an app that allows users to search for guides who can show them around specific places/cities. Only the frontend was written for this application using React. Our team - 2YellowGang took second place at the #Art of Product Building Hackathon!
pl: Wspólnie z team'em zaprojektowaliśmy aplikację umożliwiającą użytkownikom wyszukiwanie przewodników którzy mogą oprowadzić ich po określonych miejscach/miastach. Do tej aplikacji został napisany jedynie frontend za pomocą React'a. Nasz zespół - 2YellowGang zajął drugie miejsce na #Art of Product Building Hackathon!
